ROBOTIS-GIT/Arduino_Core_STM32/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# XELNetwork boards

XELNetwork.name=XELNetwork

XELNetwork.build.vid=0x0483
XELNetwork.build.core=arduino
XELNetwork.build.board=XELNetwork
XELNetwork.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# SensorXEL board (lastest)
XELNetwork.menu.pnum.SensorXEL=SensorXEL. (32kb RAM)
XELNetwork.menu.pnum.SensorXEL.upload.maximum_data_size=32768
XELNetwork.menu.pnum.SensorXEL.upload.maximum_size=52736
XELNetwork.menu.pnum.SensorXEL.upload.flash_address=0x08003000
XELNetwork.menu.pnum.SensorXEL.build.mcu=cortex-m3
XELNetwork.menu.pnum.SensorXEL.build.board=SensorXEL
XELNetwork.menu.pnum.SensorXEL.build.series=STM32L1xx
XELNetwork.menu.pnum.SensorXEL.build.product_line=STM32L151xBA
XELNetwork.menu.pnum.SensorXEL.build.variant=XELNetwork_SensorXEL
XELNetwork.menu.pnum.SensorXEL.build.flash_offset=0x3200
XELNetwork.menu.pnum.SensorXEL.build.cmsis_lib_gcc=arm_cortexM3l_math
XELNetwork.menu.pnum.SensorXEL.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset} -DSERIAL_TX_BUFFER_SIZE=1024 -DSERIAL_RX_BUFFER_SIZE=1024
XELNetwork.menu.pnum.SensorXEL.bootloader.tool = stm32flash
XELNetwork.menu.pnum.SensorXEL.bootloader.file = sensorXel_boot.bin

# PowerXEL board (lastest)
XELNetwork.menu.pnum.PowerXEL=PowerXEL. (32kb RAM)
XELNetwork.menu.pnum.PowerXEL.upload.maximum_data_size=32768
XELNetwork.menu.pnum.PowerXEL.upload.maximum_size=52736
XELNetwork.menu.pnum.PowerXEL.upload.flash_address=0x08003000
XELNetwork.menu.pnum.PowerXEL.build.mcu=cortex-m3
XELNetwork.menu.pnum.PowerXEL.build.board=PowerXEL
XELNetwork.menu.pnum.PowerXEL.build.series=STM32L1xx
XELNetwork.menu.pnum.PowerXEL.build.product_line=STM32L151xBA
XELNetwork.menu.pnum.PowerXEL.build.variant=XELNetwork_PowerXEL
XELNetwork.menu.pnum.PowerXEL.build.flash_offset=0x3200
XELNetwork.menu.pnum.PowerXEL.build.cmsis_lib_gcc=arm_cortexM3l_math
XELNetwork.menu.pnum.PowerXEL.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset} -DSERIAL_TX_BUFFER_SIZE=1024 -DSERIAL_RX_BUFFER_SIZE=1024
XELNetwork.menu.pnum.PowerXEL.bootloader.tool = stm32flash
XELNetwork.menu.pnum.PowerXEL.bootloader.file = powerXel_boot.bin

# SensorXEL board revE
#XELNetwork.menu.pnum.SensorXEL_revE=SensorXEL_revE. (32kb RAM)
#XELNetwork.menu.pnum.SensorXEL_revE.upload.maximum_data_size=32768
#XELNetwork.menu.pnum.SensorXEL_revE.upload.maximum_size=52736
#XELNetwork.menu.pnum.SensorXEL_revE.upload.flash_address=0x08003000
#XELNetwork.menu.pnum.SensorXEL_revE.build.mcu=cortex-m3
#XELNetwork.menu.pnum.SensorXEL_revE.build.board=SensorXEL_revE
#XELNetwork.menu.pnum.SensorXEL_revE.build.series=STM32L1xx
#XELNetwork.menu.pnum.SensorXEL_revE.build.product_line=STM32L151xBA
#XELNetwork.menu.pnum.SensorXEL_revE.build.variant=XELNetwork_SensorXEL_revE
#XELNetwork.menu.pnum.SensorXEL_revE.build.flash_offset=0x3200
#XELNetwork.menu.pnum.SensorXEL_revE.build.cmsis_lib_gcc=arm_cortexM3l_math
#XELNetwork.menu.pnum.SensorXEL_revE.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset} -DSERIAL_TX_BUFFER_SIZE=1024 -DSERIAL_RX_BUFFER_SIZE=1024
#XELNetwork.menu.pnum.SensorXEL_revE.bootloader.tool = stm32flash
#XELNetwork.menu.pnum.SensorXEL_revE.bootloader.file = sensorXel_boot_revE.bin

# CommXEL board (lastest)
XELNetwork.menu.pnum.CommXEL=CommXEL. (320kb RAM)
XELNetwork.menu.pnum.CommXEL.upload.maximum_data_size=327680
XELNetwork.menu.pnum.CommXEL.upload.maximum_size=785920
XELNetwork.menu.pnum.CommXEL.upload.flash_address=0x08040000
XELNetwork.menu.pnum.CommXEL.build.mcu=cortex-m7
XELNetwork.menu.pnum.CommXEL.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
XELNetwork.menu.pnum.CommXEL.build.board=CommXEL
XELNetwork.menu.pnum.CommXEL.build.series=STM32F7xx
XELNetwork.menu.pnum.CommXEL.build.product_line=STM32F746xx
XELNetwork.menu.pnum.CommXEL.build.variant=XELNetwork_CommXEL
XELNetwork.menu.pnum.CommXEL.build.flash_offset=0x40200
XELNetwork.menu.pnum.CommXEL.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
XELNetwork.menu.pnum.CommXEL.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset} -DUSBCON -DUSBD_USE_CDC -DUSBD_VID=0xFFF1 -DUSB_PRODUCT="ROBOTIS" -DHAL_PCD_MODULE_ENABLED -DSERIAL_TX_BUFFER_SIZE=4096 -DSERIAL_RX_BUFFER_SIZE=4096
XELNetwork.menu.pnum.CommXEL.bootloader.tool = dfu_util
XELNetwork.menu.pnum.CommXEL.bootloader.file = commXel_boot.bin

# Upload menu
XELNetwork.menu.upload_method.xel_loader=XEL Loader (Serial)
XELNetwork.menu.upload_method.xel_loader.upload.protocol=0
XELNetwork.menu.upload_method.xel_loader.upload.options={serial.port.file} 1000000
XELNetwork.menu.upload_method.xel_loader.upload.tool=xel_loader
XELNetwork.menu.upload_method.xel_loader.build.bootloader_flags=-DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Serialx activation
XELNetwork.menu.xserial.generic=Enabled (generic 'Serial')
XELNetwork.menu.xserial.none=Enabled (no generic 'Serial')
XELNetwork.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
XELNetwork.menu.xserial.disabled=Disabled (no Serial support)
XELNetwork.menu.xserial.disabled.build.xSerial=

# Optimizations
XELNetwork.menu.opt.osstd=Smallest (-Os default)
XELNetwork.menu.opt.oslto=Smallest (-Os) with LTO
XELNetwork.menu.opt.oslto.build.flags.optimize=-Os -flto
XELNetwork.menu.opt.o1std=Fast (-O1)
XELNetwork.menu.opt.o1std.build.flags.optimize=-O1
XELNetwork.menu.opt.o1lto=Fast (-O1) with LTO
XELNetwork.menu.opt.o1lto.build.flags.optimize=-O1 -flto
XELNetwork.menu.opt.o2std=Faster (-O2)
XELNetwork.menu.opt.o2std.build.flags.optimize=-O2
XELNetwork.menu.opt.o2lto=Faster (-O2) with LTO
XELNetwork.menu.opt.o2lto.build.flags.optimize=-O2 -flto
XELNetwork.menu.opt.o3std=Fastest (-O3)
XELNetwork.menu.opt.o3std.build.flags.optimize=-O3
XELNetwork.menu.opt.o3lto=Fastest (-O3) with LTO
XELNetwork.menu.opt.o3lto.build.flags.optimize=-O3 -flto
XELNetwork.menu.opt.ogstd=Debug (-g)
XELNetwork.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library
XELNetwork.menu.rtlib.nano=Newlib Nano (default)
XELNetwork.menu.rtlib.nanofp=Newlib Nano + Float Printf
XELNetwork.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
XELNetwork.menu.rtlib.nanofs=Newlib Nano + Float Scanf
XELNetwork.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
XELNetwork.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
XELNetwork.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
XELNetwork.menu.rtlib.full=Newlib Standard
XELNetwork.menu.rtlib.full.build.flags.ldspecs=
